/**
 * Created by Bjatta on 24.04.2017.
 * #10.12
 * 10.12.Даны  две  последовательности
 * целых  чисел:
 *   1   2      8,  , ...,a8
 * и 1   2      8,  , ...,b8
 * Найти количество четных чисел в первой из них
 * и количество нечетных во второй.
 * (Определить функцию, позволяющую
 * распознавать четные числа.)
 */
;((a,b)=> {
"use strict";
let isEven = (n) => !(n%2);
if (a.length){
    console.log(
        a.reduce((p,c)=>isEven(c)?p+=1:p,0),
        b.reduce((p,c)=>isEven(c)?p:p+=1,0)
    );
}
}
)([2,2,3,4,5,6,7,8],
  [1,2,3,4,5,6,7,8]);